#2️⃣ შექმენი ნუსხა: შექმენი ნუსხა, რომელიც შეიცავს 10 რიცხვს (მაგალითად: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]).
n = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]


#3️⃣ დაბეჭდეთ ნუსხის ელემენტები დიაპაზონით: (დიაპაზონი), რომ დაბეჭდოთ ნუსხის ელემენტები 0-დან 5-მდე (დაახლოებით: [1, 2, 3, 4, 5]).

print(n[0:5])


#4️⃣ დაბეჭდეთ ნუსხის ელემენტები შემდეგ დიაპაზონზე:
#დაბეჭდეთ ელემენტები 3-დან 7-მდე (დაახლოებით: [4, 5, 6, 7]).

print(n[2:6])


#5️⃣ დაბეჭდეთ ნუსხის ყველა ელემენტი:
#დაბეჭდეთ ნუსხის ყველა ელემენტი, რომელიც გყავთ.

print(n)