#განვიხილოთ input და output

# input და output არის ასე ვთქვათ, კომუნიკაცია კომპიუტერულ მოწყობილობასა და გარე, ცოცხალ სამყაროს შორის. 
# input-ია ინფორმაცია, რომელსაც მოწყობილობა გარე სამყაროსგან იღებს და ამუშავებს. ანუ მონაცემი, რომელსაც ჩვენ პროგრამას ვაძლევთ. 
# input როგორც ითარგმნება "ჩადება, შიგნით", ის მნიშვნელობა აქვს

 # example:
name=input("what's your kitty's name? ")
print("cute" + name)
birthday=str(input("what day were you born? : "))
print("i was born on" + " " + "february" + " " + birthday + "th")
height=str(input("how tall do you want to be? : "))
print("i wanna be" + " " + str(height) + " " + "cm talls")

# output კი ინფორმაცია, რომელსაც მოწყობილობა გამოსცემს და ჩვენ, ცოცხალ სამყაროს გვაწვდის. ანუ ინფორმაციის დამუშავების შედეგი. 
# output-იც ასევე ზუსტად ითარგმნება, "გამოსვლა, გამოდის"
# რა თქმა უნდა არის, როცა რაიმეს ორივე აქვს, input და output და მგონი თითქმის ყველაფერს.

# input-ის მაგალითებია: კალკულატორი. მასში რიცხვითი მონაცემი შეგვყავს.

 # example
print(26*2) 
#(ეს კალკულატორში, მაგრამ პითონშიც input და output ხდება ამ შემთხვევაში)

# output ხდება შემდეგ, ანუ შედეგი გამოდის და ვხედავთ შედეგს, რისი ანგარიშიც გვსურდა.

# input-ია ვთქვათ დინამიკისთვის მოწყობილობის მეშვეობით მუსიკის არჩევა, output კი ეს მუსიკა რომ გვესმის დინამიკიდან.

# input: საძიებო ველი, ზოლი (search bar). მასში შეგვყავს ინფორმცაია, ვუსვამთ კითხვას. 
# output: ინფორმაციის შეყვანის შემდეგ ვხედავთ შედეგს, ინფორმაციას, რომელსაც მოწყობილობა გარე სამყაროს გადასცემს. 

# input, როცა კლავიატურაზე ვკრეფთ.
# output კი როდესაც კომპიუტერზე ტექსტი ჩანს.„

# input: ვწერთ python-ში ან html-ში კოდს
# output: კოდის შედეგი ტერმინალზე ჩნდება
 # მაგალითები: 

print(81//9)
print(44+54)

name = "salome"
surname = "maisuradze"
favband = "korn"

print(name + " " + surname + " " + favband)

mom = 43
dad = 45
me = 14
grandma = 72 
grandpa = 78

print (mom + dad + me + grandma + grandpa)

#იმედი მაქვს ინფორმაციის მომცემი პრეზენტაცია იყო, ნახვამდის <3 