print(33+11)
print(33-11)
print(33*11)
print(33//11)
print(33/11)
print(33%11)


# debugging - პროგრამირებაში შეცდომის გამოსწორებაა. პირველ რიგში შეცდომის ინდენტიფიცირებაა, ანუ სად ხდება შეცდომა. შემდეგ შეცდომას ისევ ვუშვებთ რომ გავიგოთ, თუ სად ხდება შეცდომა. შემდეგ ვაანალიზებთ და ბოლოს დასწორებთ შეცდომას.

# როგორ მოვახდენთ ცვლადის მნიშვნელობის განახლებას და შევცვლით ოპერატორს. მაგალითად:
print(26-3)
# ეს გამოიტანს პასუხად 23-ს

# ახლა შევცვალოთ ოპერატორი
print(26+3)
# უკვე მნიშვნელობა სხვა გახდება

# ასე ხდება ამ შემთხვევებშიც:
print(26*3)
print(23//3)
print(23/3)
print(23%3)