# 1️⃣ 📜 შექმენი სია:
# შექმენით სია, რომელიც შეიცავს 10 ელემენტს, მაგალითად: ნივთები, სახელები ან რიცხვები. 🧩 აირჩიე 10 ისეთი რამ, რაც გინდა, რომ იყოს სიაში!

xaxa = ["ვეფხისტყაოსანი", 26, "თბილისი", 0.1, "ღვინო", "გიტარა", "პიანინო", "American Phsyco", 44, "პილმენი ქოთანში"]
print(xaxa)


# 2️⃣ list = [17,2,3,4,10,6,100,8,9,11] 
# მოცემულია სია რომელიც წერია არასწორად თქვენი დავალებაა რომ შეასწოროთ ის 

list = [2, 3, 4, 6, 8, 9, 10, 11, 17, 100] 
print(list)


# 3️⃣ 🔄 შემოიტანეთ რიცხვების სია და დაბეჭდეთ ელემენტები მესამე და მეშვიდე ინდექს შორის

n = [2, 5, 9, 12, 17, 22, 26, 33, 36]
   # 0, 1, 2, 3,  4,  5,  6,  7,  8
print(n[3:7])


# 4️⃣ 🏁 დაბეჭდეთ ბოლო სამი ელემენტი:
# თქვენი სიის ბოლო სამი ნივთი! 🌟 

hoho = ["სტუმარ-მასპინძელი", 36, "ბათუმი", 0.5, "ყავა", "გიტარა", "მუსიკა", "American Phsyco", 46, "ხაჭაპური"]
print(hoho[7], hoho[8], hoho[9])

# მეორე ხერხი:

print(hoho[-3:])

# მინუსის გამოყენებისას ბოლო ელემენტიდან იწყება ათვლა. 




